Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In this file there are some example rules to decide whether the overall status of the house is deemed inappropriate, triggering the necessary `Alert` (s).
ja_jp: このファイルには、家の全体的な状態が不適切であるかどうかを判断し、必要なアラートをトリガーするためのサンプルルールがいくつかあります。

source: In this file, copy the following code:
ja_jp: このファイルに、以下のコードをコピーします。

source: In this guide we are going to develop the *Sample Greeting Extension*. The extension will expose a customizable HTTP endpoint which simply greets the visitor.
ja_jp: このガイドでは、*サンプル Greeting エクステンション* を開発します。このエクステンションは、ビジターに挨拶をするだけのカスタマイズ可能な HTTP エンドポイントを公開します。

source: In this guide we are going to implement a REST resource, namely `MovieResource`, that will consume movie DTOs and put them in a Kafka topic.
ja_jp: このガイドでは、REST リソース、つまりムービー DTO を消費して Kafka トピックに配置する `MovieResource` を実装します。

source: In this guide we explore Smallrye Reactive Messaging framework to interact with Apache Kafka. Quarkus extension for Kafka also allows xref:kafka.adoc#kafka-bare-clients[using Kafka clients directly].
ja_jp: このガイドでは、Apache Kafka と対話するための Apache Kafka フレームワークについて説明します。Kafka の Quarkus エクステンションでは、xref:kafka.adoc#kafka-bare-clients[Kafka クライアントの直接使用] も可能です。

source: In this guide we explore how to interact with Apache Pulsar using the Quarkus Messaging extensions. xref:pulsar.adoc#configuring-pulsar-clients[using Pulsar clients directly].
ja_jp: このガイドでは、Quarkus Messaging エクステンションを使用して Apache Pulsar と対話する方法について説明します。 xref:pulsar.adoc#configuring-pulsar-clients[Pulsar クライアントディレクトリーの使用]。

source: In this guide we explore how we can interact with Apache Kafka using the Quarkus Messaging extensions. Quarkus extension for Kafka also allows xref:kafka.adoc#kafka-bare-clients[using Kafka clients directly].
ja_jp: このガイドでは、Quarkusのメッセージングエクステンションを使用してApache Kafkaと対話する方法を探ります。 Kafka用のQuarkusエクステンションでは、 xref:kafka.adoc#kafka-bare-clients[Kafkaクライアントを直接使用する] こともできます。

source: In this guide we used the Quarkus code generation mechanism to generate Java files from Avro schema.
ja_jp: このガイドでは、Quarkus コード生成メカニズムを使用して、Avro スキーマから Java ファイルを生成しました。

source: In this guide we will be demonstrating how to consume part of the REST API supplied by the link:https://stage.code.quarkus.io[stage.code.quarkus.io] service. Our first order of business is to set up the model we will be using, in the form of a `Extension` POJO.
ja_jp: このガイドでは、link:https://stage.code.quarkus.io[stage.code.quarkus.io] サービスが提供する REST API の一部を利用する方法をデモします。 まず最初に、使用するモデルを `Extension` POJO の形式でセットアップします。

source: In this guide we will be demonstrating how to consume part of the REST API supplied by the link:https://stage.code.quarkus.io[stage.code.quarkus.io] service. Our first order of business is to set up the model we will be using, in the form of an `Extension` POJO.
ja_jp: このガイドでは、 link:https://stage.code.quarkus.io[stage.code.quarkus.io] サービスが提供するREST APIの一部を利用する方法をデモします。まず最初に、 使用するモデルを `Extension` POJO の形式でセットアップします。

source: In this guide we will be demonstrating how to invoke a REST service accepting `multipart/form-data` input. We are assuming the payload is well-known before the request is sent, so we can model as a POJO.
ja_jp: このガイドでは、 `multipart/form-data` の入力を受け付けるRESTサービスを起動する方法を紹介します。リクエストが送信される前にペイロードが既知であることを想定しているので、POJOとしてモデル化することができます。

source: In this guide we're going to describe the basic principles of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window="_blank"] specification.
ja_jp: このガイドでは、 http://docs.jboss.org/cdi/spec/2.0/cdi-spec.html[Contexts and Dependency Injection for Java 2.0, window=_blank]仕様に基づいたQuarkusプログラミングモデルの基本原理について説明します。

source: In this guide we're going to describe the basic principles of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[Jakarta Contexts and Dependency Injection 4.0, window="_blank"] specification.
ja_jp: このガイドでは、 link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[Jakarta Contexts and Dependency Injection 4.0] 仕様に基づくQuarkusプログラミングモデルの基本原則について説明します。

source: In this guide we're going to describe the basic principles of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta Contexts and Dependency Injection 4.1, window="_blank"] specification. The xref:cdi-reference.adoc[CDI reference guide] describes the bean discovery, non-standard features and configuration properties. The xref:cdi-integration.adoc[CDI integration guide] has more detail on common CDI-related integration use cases, and example code for solutions.
ja_jp: このガイドでは、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta コンテキストと依存性の注入 4.1, window="_blank"] 仕様に基づいた Quarkus プログラミングモデルの基本原則について説明します。 xref:cdi-reference.adoc[CDI リファレンスガイド] では、Bean の検出、非標準機能、および設定プロパティーについて説明します。 xref:cdi-integration.adoc[CDI 統合ガイド] には、一般的な CDI 関連の統合ユースケースとソリューションのサンプルコードの詳細が記載されています。

source: In this guide you will learn how to deploy a Quarkus based web application as a web-dyno to Heroku.
ja_jp: このガイドでは、Quarkus ベースの Web アプリケーションを web-dyno として Heroku にデプロイする方法を説明します。

source: In this guide, we are going to develop the *Sample Greeting Extension*. The extension will expose a customizable HTTP endpoint that simply greets the visitor.
ja_jp: このガイドでは、*サンプル Greeting エクステンション* を開発します。このエクステンションは、訪問者に挨拶するだけのカスタマイズ可能な HTTP エンドポイントを公開します。

source: In this guide, we are going to develop two applications communicating with Kafka. The first application sends a _quote request_ to Kafka and consumes Kafka messages from the _quote_ topic. The second application receives the _quote request_ and sends a _quote_ back.
ja_jp: このガイドでは、Kafka と通信する 2 つのアプリケーションを開発します。最初のアプリケーションは _見積りリクエスト_ を Kafka に送信し、_見積り_ トピックからの Kafka メッセージを消費します。2 つ目のアプリケーションは _見積りリクエスト_ を受信し、_見積り_ を送り返します。

source: In this guide, we are going to develop two applications communicating with Pulsar. The first application sends a _quote request_ to Pulsar and consumes Pulsar messages from the _quote_ topic. The second application receives the _quote request_ and sends a _quote_ back.
ja_jp: このガイドでは、Pulsar と通信する 2 つのアプリケーションを開発します。最初のアプリケーションは _見積りリクエスト_ を Pulsar に送信し、_見積り_ トピックからの Pulsar メッセージを消費します。2 つ目のアプリケーションは _見積りリクエスト_ を受信し、_見積り_ を送り返します。

source: In this guide, we are going to develop two applications communicating with a RabbitMQ broker. The first application sends a _quote request_ to the RabbitMQ _quote requests_ exchange and consumes messages from the _quote_ queue. The second application receives the _quote request_ and sends a _quote_ back.
ja_jp: このガイドでは、RabbitMQ ブローカーと通信する 2 つのアプリケーションを開発します。1つ目のアプリケーションは、RabbitMQの _見積要求_ エクスチェンジに _見積要求_ を送信し、 _見積_ キューからメッセージを消費します。2 番目のアプリケーションは、 _見積要求_ を受信し、 _見積_ を送り返します。

source: In this guide, we are going to develop two applications communicating with an AMQP broker. We will use https://activemq.apache.org/components/artemis/[Artemis], but you can use any AMQP 1.0 broker. The first application sends a _quote request_ to an AMQP queue and consumes messages from the _quote_ queue. The second application receives the _quote request_ and sends a _quote_ back.
ja_jp: このガイドでは、AMQP ブローカーと通信する 2 つのアプリケーションを開発します。 https://activemq.apache.org/components/artemis/[Artemis] を使用しますが、任意の AMQP 1.0 ブローカーを使用できます。最初のアプリケーションは _quote request_ を AMQP キューに送信し、 _quote_ queue からのメッセージを消費します。2 番目のアプリケーションは _quote request_ を受信し、_quote_ back を送信します。

source: In this guide, we are going to expose a Greeting Rest API to create and display greeting messages by using the https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#remotecache_api[Infinispan RemoteCache API] and `getAsync` and `putAsync` operations.
ja_jp: 本ガイドでは、 link:https://infinispan.org/docs/stable/titles/hotrod_java/hotrod_java.html#remotecache_api[Infinispan RemoteCache API] と `getAsync` 、 `putAsync` の操作を利用して、挨拶のメッセージを作成、表示するGreeting Rest APIを公開します。

source: In this guide, we are going to expose a simple Rest API to increment numbers by using the https://redis.io/commands/incrby[`INCRBY`] command. Along the way, we'll see how to use other Redis commands like `GET`, `SET` (from the string group), `DEL` and `KEYS` (from the key group).
ja_jp: このガイドでは、 link:https://redis.io/commands/incrby[`INCRBY`] コマンドを使用して、数値をインクリメントするシンプルな Rest API を公開します。また、 `GET` 、 `SET（文字列グループ）` 、 `DEL` 、 `KEYS（キーグループ）` のような他の Redis コマンドの使い方も見ていきましょう。

source: In this guide, we are going to expose a simple Rest API to increment numbers by using the https://redis.io/commands/incrby[`INCRBY`] command. Along the way, we'll see how to use other Redis commands like `GET`, `SET`, `DEL` and `KEYS`.
ja_jp: このガイドでは、 link:https://redis.io/commands/incrby[`INCRBY`] コマンドを使用して、数値をインクリメントするシンプルな Rest API を公開します。また、 `GET` 、 `SET` 、 `DEL` 、 、 `KEYS` のような他の Redis コマンドの使い方も見ていきましょう。

source: In this guide, we are going to expose one Rest API `tasks` to visualise the list of tasks created by a Quartz job running every 10 seconds.
ja_jp: このガイドでは、10秒ごとに実行されるQuartzジョブによって作成されたタスクのリストを可視化するために、1つのRest API `tasks` を公開します。

source: In this guide, we are going to generate (random) prices in one component. These prices are written to a queue (`prices`) using a JMS client. Another component reads from the `prices` queue and stores the latest price. The data can be fetched from a browser using a fetch button from a JAX-RS resource.
ja_jp: このガイドでは、あるコンポーネントが(ランダムな)価格を生成します。これらの価格は、JMS クライアントを使用してキュー ( `prices` ) に書き込まれます。別のコンポーネントが `prices` のキューから読み込み、最新の価格を保存します。データは、JAX-RSリソースからフェッチボタンを使用してブラウザで取得することができます。

source: In this guide, we are going to generate (random) prices in one component. These prices are written to a queue (`prices`) using a JMS client. Another component reads from the `prices` queue and stores the latest price. The data can be fetched from a browser using a fetch button from a Jakarta REST resource.
ja_jp: このガイドでは、1つのコンポーネントで（ランダムな）価格を生成することにしています。これらの価格は、JMSクライアントを使用してキュー( `prices` )に書き込まれます。別のコンポーネントは `prices` のキューから読み出し、最新の価格を保存します。データは、Jakarta RESTリソースからフェッチボタンを使ってブラウザから取得することができます。

source: In this guide, we are going to generate (random) temperature values in one component (named `generator`). These values are associated to given weather stations and are written in a Kafka topic (`temperature-values`). Another topic (`weather-stations`) contains just the main data about the weather stations themselves (id and name).
ja_jp: このガイドでは、(ランダムな)温度値を 1 つのコンポーネント ( `generator` ) で生成します。これらの値は、与えられた気象観測所に関連付けられ、Kafka トピック ( `temperature-values` ) に書き込まれます。別のトピック ( `weather-stations` ) には、気象観測所自体に関するマスターデータ (id と名前) だけが格納されています。

source: In this guide, we build a simple GraphQL application that exposes a GraphQL API at `/graphql`.
ja_jp: このガイドでは、 `/graphql` で GraphQL API を公開するシンプルな GraphQL アプリケーションを構築します。

source: In this guide, we build a simple REST application that exposes MicroProfile Health functionalities at the `/q/health/live` and `/q/health/ready` endpoints according to the specification.
ja_jp: このガイドでは、仕様に従って `/q/health/live` および `/q/health/ready` エンドポイントで MicroProfile Health 機能を公開するシンプルな REST アプリケーションを構築します。

source: In this guide, we create a straightforward REST application to demonstrate JFR usage.
ja_jp: このガイドでは、JFR の使用方法を示すために簡単な REST アプリケーションを作成します。

source: In this guide, we create a straightforward REST application to demonstrate OTel logging, in a similar way to the other OpenTelemetry signal guides.
ja_jp: このガイドでは、他のOpenTelemetryシグナルガイドと同様に、OTelロギングを実証するための簡単なRESTアプリケーションを作成します。

source: In this guide, we create a straightforward REST application to demonstrate distributed logging, similar to the other OpenTelemetry guides.
ja_jp: このガイドでは、他のOpenTelemetryガイドと同様に、分散ロギングを実証するための簡単なRESTアプリケーションを作成します。

source: In this guide, we create a straightforward REST application to demonstrate distributed tracing.
ja_jp: このガイドでは、分散トレースを実証するための簡単なRESTアプリケーションを作成します。

source: In this guide, we create a straightforward REST application to demonstrate how fast you can expose your API specification and benefit from a user interface to test it.
ja_jp: このガイドでは、API の仕様をいかに早く公開し、ユーザーインターフェイスから利益を得てテストできるかを実証するために、簡単な REST アプリケーションを作成します。

source: In this guide, we create a straightforward REST application to demonstrate metrics.
ja_jp: このガイドでは、メトリクスをデモンストレーションするために、簡単な REST アプリケーションを作成します。

source: In this guide, we create a straightforward application accessible using HTTP to get the current value of a counter. This counter is periodically (every 10 seconds) incremented.
ja_jp: このガイドでは、カウンタの現在値を取得するために HTTP を使用してアクセスできる簡単なアプリケーションを作成します。このカウンタは定期的に (10 秒ごとに) インクリメントされます。

source: In this guide, we create a straightforward application serving a `hello` endpoint with a single source file, no additional build files like `pom.xml` or `build.gradle` needed. To demonstrate dependency injection, this endpoint uses a `greeting` bean.
ja_jp: このガイドでは、 `hello` エンドポイントを提供する簡単なアプリケーションを、 `pom.xml` や `build.gradle` のようなビルドファイルを追加することなく、単一のソースファイルで作成します。依存関係の注入の動作を確認するために、このエンドポイントは `greeting` Bean を使用します。

source: In this guide, we create a straightforward application serving a `hello` endpoint. To demonstrate dependency injection, this endpoint uses a `greeting` bean.
ja_jp: このガイドでは、 `hello` エンドポイントを提供する簡単なアプリケーションを作成します。依存性の注入を示すために、このエンドポイントでは `greeting` Bean を使用します。

source: In this guide, we create a straightforward chat application using web sockets to receive and send messages to the other connected users.
ja_jp: このガイドでは、WebSocketを使用して、接続されている他のユーザーとメッセージを送受信するための簡単なチャットアプリケーションを作成します。

source: In this guide, we demonstrate usage of MicroProfile Fault Tolerance annotations such as `@Timeout`, `@Fallback`, `@Retry` and `@CircuitBreaker`.
ja_jp: このガイドでは、 `@Timeout` , `@Fallback` , `@Retry` および `@CircuitBreaker` などの MicroProfile Fault Tolerance アノテーションの使用法を説明します。

source: In this guide, we demonstrate usage of MicroProfile Fault Tolerance annotations such as `@Timeout`, `@Fallback`, `@Retry`, `@CircuitBreaker`, and `@RateLimit`.
ja_jp: このガイドでは、MicroProfile Fault Tolerance アノテーションである`@Timeout`、`@Fallback`、`@Retry`、`@CircuitBreaker`および `@RateLimit` の使用方法を説明します。

source: In this guide, we expand on the initial test that was created as part of the Getting Started Guide. We cover injection into tests and also how to test native executables.
ja_jp: このガイドでは、入門ガイドの一部として作成された最初のテストを拡張します。 テストへのインジェクションと、ネイティブ実行可能ファイルをテストする方法もカバーしています。

source: In this guide, we see how you can get your REST services to consume and produce JSON payloads.
ja_jp: このガイドでは、REST サービスが JSON ペイロードを利用および生成する方法を見ていきます。

source: In this guide, we see how you can get your REST services to use the MongoDB database.
ja_jp: このガイドでは、RESTサービスでMongoDBデータベースを使用する方法を見ていきます。

source: In this guide, we see how you can use virtual threads in a REST application. Because virtual threads are all about I/O, we will also use the REST client.
ja_jp: このガイドでは、REST アプリケーションで仮想スレッドを使用する方法を説明します。 仮想スレッドは I/O に関するものなので、REST クライアントも使用します。

source: In this guide, we use the default Quarkus Cache backend (Caffeine). You can use Infinispan or Redis instead. Refer to the xref:cache-infinispan-reference.adoc[Infinispan cache backend reference] to configure the Infinispan backend. Refer to the xref:cache-redis-reference.adoc[Redis cache backend reference] to configure the Redis backend.
ja_jp: このガイドでは、デフォルトのQuarkus Cacheバックエンド（Caffeine）を使用します。 代わりに、InfinispanまたはRedisを使用できます。 Infinispanバックエンドを設定するには、 xref:cache-infinispan-reference.adoc[Infinispanキャッシュバックエンドリファレンス] を参照してください。 Redis バックエンドを設定するには、 xref:cache-redis-reference.adoc[Redis キャッシュバックエンドリファレンス] を参照してください。

source: In this guide, we use the default Quarkus Cache backend (Caffeine). You can use Redis instead. Refer to the xref:cache-redis-reference.adoc[Redis cache backend reference] to configure the Redis backend.
ja_jp: このガイドでは、デフォルトのQuarkus Cacheバックエンド(Caffeine)を使用します。代わりにRedisを使用することができます。Redisバックエンドを設定するには xref:cache-redis-reference.adoc[Redisキャッシュバックエンドのリファレンス] を参照してください。

source: In this guide, we will build an application composed of:
ja_jp: このガイドでは、次のような構成のアプリケーションを構築します。

source: In this guide, we will build an application:
ja_jp: このガイドでは、次のアプリケーションを作成します:

source: In this guide, we will discuss how you can get your native executables to support SSL, as native executables don't support it out of the box.
ja_jp: ネイティブ実行可能ファイルは標準ではSSLをサポートしていないので、このガイドではネイティブ実行可能ファイルでSSLをサポートする方法を説明します。

source: In this guide, we will discuss how you can get your native images to support SSL, as native images don't support it out of the box.
ja_jp: このガイドでは、ネイティブイメージがそのままではSSLをサポートしていないため、ネイティブイメージをSSLに対応させる方法について説明します。

source: In this guide, we will explore:
ja_jp: このガイドでは、以下をみていきます:

source: In this guide, we will get you started with some reactive features of Quarkus. We are going to implement a simple CRUD application. Yet, unlike in the xref:hibernate-orm-panache.adoc[Hibernate with Panache guide], it uses the reactive features of Quarkus.
ja_jp: このガイドでは、Quarkusのリアクティブな機能をご紹介します。簡単なCRUDアプリケーションを実装する予定です。ただし、 xref:hibernate-orm-panache.adoc[Hibernate with Panacheガイド] とは異なり、Quarkusのリアクティブ機能を使用します。

source: In this guide, we will see how you can get your REST services to interact with an Elasticsearch cluster.
ja_jp: このガイドでは、RESTサービスをElasticsearchクラスタと接続する方法を紹介します。

source: In this guide, we will see how you can get your REST services to use a Cassandra database.
ja_jp: このガイドでは、RESTサービスでCassandraデータベースを使用する方法を見ていきます。

source: In this guide, we will see how you can get your REST services to use an Elasticsearch cluster.
ja_jp: このガイドでは、RESTサービスでElasticsearchクラスターを使用する方法を見ていきます。

source: In this guide, we will see how you can write a REST application using just a single Java file.
ja_jp: このガイドでは、1つの Java ファイルだけを使って REST アプリケーションを書く方法を見ていきます。

source: In this guide, we will use Mutiny. To know more about Mutiny, check the xref:mutiny-primer.adoc[Mutiny documentation].
ja_jp: このガイドでは、Mutinyを使用します。Mutinyについて詳しく知りたい方は、 link:mutiny-primer.html[Mutinyのドキュメント]をご覧ください。

source: In this guide, we will use the Mutiny API of the Reactive PostgreSQL Client. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: このガイドでは、Reactive PostgreSQL Client の Mutiny API を使用します。Mutiny についてよく知らない方は、xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library] を参照してください。

source: In this guide, we will work with a few components deployed in a Kubernetes cluster:
ja_jp: このガイドでは、Kubernetes クラスターにデプロイされたいくつかのコンポーネントを使用します。

source: In this guide, we've covered some basic topics of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window="_blank"] specification. However, a full CDI implementation is not used under the hood. Quarkus only implements a subset of the CDI features - see also <<cdi-reference.adoc#supported_features,the list of supported features>> and <<cdi-reference.adoc#limitations,the list of limitations>>. On the other hand, there are quite a few <<cdi-reference#nonstandard_features,non-standard features>> and <<cdi-reference.adoc#build_time_apis,Quarkus-specific APIs>>. We believe that our efforts will drive the innovation of the CDI specification towards the build-time oriented developer stacks in the future.
ja_jp: このガイドでは、 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window=_blank] 仕様に基づいたQuarkusプログラミングモデルの基本的なトピックをいくつか紹介しました。しかし、完全なCDIの実装はフードの下では使用されていません。QuarkusはCDI機能のサブセットを実装しているだけです。 <<cdi-reference.adoc#supported_features,サポートされている機能のリスト>> と <<cdi-reference.adoc#limitations,制約事項>> のリストも参照してください。一方で、 <<cdi-reference#nonstandard_features,標準外の機能>> や <<cdi-reference.adoc#build_time_apis,Quarkus固有のAPIs>> もかなりあります。私たちの取り組みが、将来的にビルド時指向の開発スタックに向けたCDI仕様の革新を促進すると信じています。

source: In this guide, we've covered some basic topics of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[Jakarta Contexts and Dependency Injection 4.0, window="_blank"] specification. Quarkus implements the CDI Lite specification, but not CDI Full. See also <<cdi-reference.adoc#supported_features_and_limitations,the list of supported features and limitations>>. There are also quite a few <<cdi-reference#nonstandard_features,non-standard features>> and <<cdi-reference.adoc#build_time_apis,Quarkus-specific APIs>>.
ja_jp: このガイドでは、 link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[Jakarta Contexts and Dependency Injection 4.0] 仕様に基づく Quarkus プログラミングモデルの基本的なトピックについて説明しました。 QuarkusはCDI Lite仕様を実装していますが、CDI Full仕様は実装していません。 xref:cdi-reference.adoc#supported_features_and_limitations[サポートされる機能と制限事項のリスト] も参照してください。 また、 xref:cdi-reference.adoc#nonstandard_features[非標準] の機能や xref:cdi-reference.adoc#build_time_apis[Quarkus固有のAPI] も数多くあります。

source: In this guide, we've covered some basic topics of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[Jakarta Contexts and Dependency Injection 4.0, window="_blank"] specification. Quarkus implements the CDI Lite specification, but not CDI Full. See also xref:cdi-reference.adoc#supported_features[the list of supported features] and xref:cdi-reference.adoc#limitations[the list of limitations]. There are also quite a few xref:cdi-reference.adoc#nonstandard_features[non-standard features] and xref:cdi-reference.adoc#build_time_apis[Quarkus-specific APIs].
ja_jp: このガイドでは、 link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html[Jakarta Contexts and Dependency Injection 4.0] 仕様に基づくQuarkusプログラミングモデルの基本的なトピックについて説明しました。 QuarkusはCDI Lite仕様を実装していますが、CDI Full仕様は実装していません。 xref:cdi-reference.adoc#supported_features[サポートされる機能のリスト] と xref:cdi-reference.adoc#limitations[制限事項のリスト] も参照してください。また、 xref:cdi-reference.adoc#nonstandard_features[非標準の機能] や xref:cdi-reference.adoc#build_time_apis[Quarkus固有のAPI] も多数あります。

source: In this guide, we've covered some basic topics of the Quarkus programming model that is based on the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta Contexts and Dependency Injection 4.1, window="_blank"] specification. Quarkus implements the CDI Lite specification, but not CDI Full. See also <<cdi-reference.adoc#supported_features_and_limitations,the list of supported features and limitations>>. There are also quite a few <<cdi-reference#nonstandard_features,non-standard features>> and <<cdi-reference.adoc#build_time_apis,Quarkus-specific APIs>>.
ja_jp: このガイドでは、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta コンテキストと依存性の注入 4.1, window="_blank"] 仕様に基づいた Quarkus プログラミングモデルの基本的なトピックについて説明しました。 Quarkus は CDI Lite 仕様を実装していますが、CDI Full は実装していません。 <<cdi-reference.adoc#supported_features_and_limitations,the list of supported features and limitations>> も参照してください。 <<cdi-reference#nonstandard_features,non-standard features>> と <<cdi-reference.adoc#build_time_apis,Quarkus-specific APIs>> などもあります。
